resources/public/status-2016-2-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Status Update 2/1/2016</title>
<!-- 2018-04-03 Tue 13:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ed Babcock (greenyouse)" />
<meta  name="description" content="Hacks, projects, and general butt-kicking with Ed (greenyouse)"
 />
<meta  name="keywords" content="Clojure, ClojureScript, greenyouse, LISP" />
<meta name='viewport' content='width=device-width' initial-scale=1>
                     <link rel='shortcut icon' href='/img/favicon.ico' />
                     <link rel='stylesheet' href='/css/bootstrap.min.css' type='text/css'/>
                     <link rel='stylesheet' href='/css/blog.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar navbar-default">
    <div class="container-fluid">
      <div class="navbar-header">
        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#main-navbar">
          <span class="sr-only">Toggle navigation</span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </button>
        <a class="navbar-brand" href="/index.html">EDBABCOCK</a>
      </div>
      <div class="collapse navbar-collapse" id="main-navbar">
        <ul class="nav navbar-nav">
          <li><a href="/about.html">About</a></li>
          <li><a href="categories.html">Categories</a></li>

        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Status Update 2/1/2016</h1>
<p>
A few weeks ago when I started back up on doing open source projects, I
was a little worried that I might run out of things to work on. However,
the last couple weeks have shown me that I really have nothing to worry
about in that department. :)
</p>

<p>
There are seven different projects that I've put into my queue for the
next year or so. Judging how to prioritize development for the projects
will be tricky. A couple of them are open-ended, ever-expanding projects
that could probably be worked on forever (app development + p2p
networking) but most are just little one-off libraries.
</p>

<p>
Anyway, I thought it might be neat to make a public list of what I want
to work on and a blurb about each one. If any of them sound interesting
I would encourage you to work on it yourself or send me a message about
it! Each of the projects are meant to be useful, teach the developer
about the subject, and be fun to work on.
</p>

<p>
Here's a list of the projects:
</p>

<ul class="org-ul">
<li><a href="#browserific">browserific</a>
</li>
<li><a href="#deepfns">deepfns</a>
</li>
<li><a href="#es">elasticsearch library</a>
</li>
<li><a href="#p2p">erlang p2p network</a>
</li>
<li><a href="#patterns">pattern matching</a>
</li>
<li><a href="#rec-link">record linkage</a>
</li>
<li><a href="#sql">sql library</a>
</li>
</ul>

<p>
<a id="browserific" name="browserific"></a>
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Browserific</h2>
<div class="outline-text-2" id="text-1">
<p>
My old project Browserific was left in a pretty ugly state last
spring. The features were planned in advance but most of the code was
banged out quickly without good testing and had weird behaviors (like
using a <code>builds</code> folder for configs).
</p>

<p>
Right now I'm going through Browserific and chenex to clean up the code
and improve the testing situation. There's been a little bit of a hump
getting the config file stuff updated but I think it's almost over
(finally). Both projects need better testing around features too so I
think that's probably the next thing to get working on.
</p>

<p>
After catching up and making the projects more stable, the next big TODO
is adding support for NW.js. This should have happened a long time ago
but I was in a crunch for time and couldn't get around to it. The
Cordova support right now feels pretty horrible too&#x2026;
</p>

<p>
Further down the pipe, I want to jump into React Native! It sounds like
there are ClojureScript projects that have successfully interop-ed with
it already. I can probably take the Borg approach here and just
assimilate whatever I need from them into Browserific. :p
</p>

<p>
On top of the actual plugin/library parts it would also be fun to write
apps for myself with the framework! I'm not sure how well the
deployment + testing situation is for ClojureScript mobile
development. I'm sure as I run through it I'll hit every snag possible
and get saddled with writing tools to automate development. That sounds
pretty neat though, honestly.
</p>


<p>
<a id="deepfns" name="deepfns"></a>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Deepfns</h2>
<div class="outline-text-2" id="text-2">
<p>
I gave a fast rundown of the deepfns in <a href="deepfns.html">my last blog post</a>. Basically this
needs slightly refined tests, pre-compilation + other speed hacks, and
some more thought how structure the internals.
</p>

<p>
Right now it feels OK as a early prototype but I'm sure it could be
improved. The biggest thing is having the macros that can pre-compile
for really fast code. If transitives ran as quickly or faster than
vanilla Clojure, I would feel 100% about using that library for future
projects.
</p>

<p>
<a id="es" name="es"></a>
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">ElasticSearch Library</h2>
<div class="outline-text-2" id="text-3">
<p>
Doing libraries like this, where it has a narrow scope and covers tools
that are already widely adopted, feels much more practical. Some of the
other projects are a little out there and I know will probably not get
very many users to try them out. Even worse, some of the projects don't
teach me skills that translate easily into actual work I would do (see
P2P networking).
</p>

<p>
This would be targeted at easing ES configs, creating composable
queries, making the ES server easier to manage, and making data
transactions on indexes easier.
</p>

<p>
The easiest part is creating composable queries via transitives. One
nice feature of transatives is that any <code>nil</code> values don't
propagate. Here's an example:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #FBDE2D;">def</span> <span style="color: #D8FA3C;">foos</span>
  (<span style="color: #EDEDED; background-color: #000000;">&lt;=&gt;</span> {<span style="color: #4c83ff;">:foo</span> <span style="color: #4c83ff;">:woot</span>
        <span style="color: #4c83ff;">:bar</span> <span style="color: #4c83ff;">:other</span>}))

(<span style="color: #FBDE2D;">def</span> <span style="color: #D8FA3C;">woots</span>
  (<span style="color: #EDEDED; background-color: #000000;">&lt;=&gt;</span> {<span style="color: #4c83ff;">:woot</span> <span style="color: #4c83ff;">:something</span>
        <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">else is nil and won't propagate</span>
        <span style="color: #4c83ff;">:other</span> <span style="color: #4c83ff;">:else</span>}))

((<span style="color: #FF6400;">comp</span> <span style="color: #EDEDED; background-color: #000000;">foos</span> <span style="color: #EDEDED; background-color: #000000;">woots</span>)
 {<span style="color: #4c83ff;">:something</span> 1
  <span style="color: #4c83ff;">:another</span> <span style="color: #61CE3C;">"thing"</span>})

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">=&gt; {:foo 1}</span>
</pre>
</div>

<p>
See how something passed to <code>:woot</code> and then to <code>:foo</code>?
</p>

<p>
Having data defined queries that can compose together nicely (and
hopefully run fast) is a nice win overall!
</p>

<p>
The other parts are in the works and I'll have to post when I get around
to working on them.
</p>

<p>
<a id="sql" name="sql"></a>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">SQL Library</h2>
<div class="outline-text-2" id="text-4">
<p>
This is in a very similar vein to the ElasticSearch library. It uses
data to build queries and focuses on composing and functions over
building a DSL of macros or other popular techniques that are out
there.
</p>

<p>
I'll have to mention more here when I get around to this too.
</p>

<p>
<a id="patterns" name="patterns"></a>
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Pattern Matching</h2>
<div class="outline-text-2" id="text-5">
<p>
I took a few days to dig into pattern matching last week and I think
there are some interesting paths that it could take. For me, getting a
good pattern matching system for Clojure has felt like an unscratchable
itch. The solutions that are out there are not very good but there might
be some ways to build it out.
</p>

<p>
The easiest path to implementing pattern matching is to have runtime
checks for patterns. This would use something like core.match or a
custom solution to conditionally pick which clause to select. The
obvious issue is that checks happen at runtime which makes the code
slower. There might be better ways to minimize the runtime checking
although it might no be possible to get rid of it.
</p>

<p>
Ironically I've been working through The Book of Shen and it has some
interesting discussion about how pattern matching was built for the
language. Shen in general has a bunch of compilers that build different
features and runtimes for the code. For example, the base language gets
compiled from Shen -&gt; L -&gt; Klambda -&gt; Host Language. More advanced
features like sequent calculus get compiled from Sequent Calc -&gt; Horn
Clauses -&gt; Micro Expressions -&gt; AUM Instructions -&gt; Shen -&gt; L -&gt; Klambda
-&gt; Host Lang. Anyway, there might be some insight into how to lift the
pattern matching features out of Shen and into a Clojure library.
</p>

<p>
The Shen system is built on top of lambda calculus and there are other
languages that also use labmda calculus for their pattern matching
too. The Erlang compiler uses the techniques from <a href="http://research.microsoft.com/en-us/um/people/simonpj/papers/slpj-book-1987/">The Implementation of
Functional Programming Languages</a> chapters 4-6. Between these two
resources I think there must be a good way to connect the dots and get
pattern matching in Clojure.
</p>

<p>
Another thing to think about is how logic programming also has pattern
matching but negates clause order! This is a separate problem
implementation wise but the goal is similar. David Nolen had a <a href="https://vimeo.com/23907627">neat talk</a>
about how macros could be used to build something like this (see
54:30).
</p>

<p>
<a id="rec-link" name="rec-link"></a>
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Record Linkage</h2>
<div class="outline-text-2" id="text-6">
<p>
This is just a neat problem in general. I've already run into this
problem a few times at work without really knowing much about record
linkage. If I would have known about it before, it would have been
incredibly useful for changing our data model!
</p>

<p>
If you're not familiar, <a href="https://en.wikipedia.org/wiki/Record_linkage">record linkage</a> identifies common items from
multiple unknown data sources. This could be something like a census
poll that has to know that someone's last name changed because they got
married. Another example is tracking inventory in a warehouse where
incoming items may have varying product descriptions.
</p>

<p>
I don't know a whole lot about the subject yet but it would be fun to
dive into it and try building some tooling for it.
</p>

<p>
<a id="p2p" name="p2p"></a>
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Erlang P2P Network</h2>
<div class="outline-text-2" id="text-7">
<p>
This is a pretty large project and I want to wrap up the Browserific
tools before getting started on this. I should probably spill the beans
on it at some point but I really don't want to quite yet. In general,
it's a combination of <a href="http://netsukuku.freaknet.org/">Netsukuku</a>, the <a href="http://www.magnusbrading.com/phantom/phantom-design-paper.pdf">Phantom Protocol</a>, and some other
ideas.
</p>

<p>
The biggest disadvantage to working on a project like this is that
there's no technical carry-over into my day job. While I can learn about
a whole bunch of networking topics, explore cool math models, etc., I'm
just a web developer at the end of the day.
</p>

<p>
The benefit to working on this after the Browserific is that the P2P
network is meant to be app-specific. The goal of the project is to have
an unhackable, turnkey solution for P2P as a back-end. Hopefully then it
would be quick to write an app and then the company behind the app would
not have to invest anything in infrastructure.
</p>

<p>
This sounds kind of crazy but it might be possible. The biggest thing
holding it back is the battery drain on mobile devices that network
requests incur. Anyway, there's a lot of cool stuff that will come up
with this.
</p>


<p>
OK, now back to work!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer> <hr />
                         <p><a href='http://creativecommons.org/licenses/by-nc-sa/3.0/' target='_blank'>©copyright 2015</a>, by <a href='/about.html'>Ed Babcock</a> (^_^)v</p>
                         </footer>
                         <script type='text/javascript' src='js/jquery.min.js'></script>
                         <script type='text/javascript' src='js/bootstrap.min.js'></script>
</div>
</body>
</html>